@wuxu92 sorry for the late answer.
```
Terraform v1.6.0
on windows_amd64
+ provider registry.terraform.io/hashicorp/azuread v2.41.0
+ provider registry.terraform.io/hashicorp/azurerm v3.81.0
```

```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # azuread_application.all["key1"] will be updated in-place
  # (imported from "<REDACTED>")
  ~ resource "azuread_application" "all" {
      <REDACTED>
    }

  # azuread_application.all["key2"] will be updated in-place
  # (imported from "<REDACTED>")
  ~ resource "azuread_application" "all" {
      <REDACTED>
    }

  # azuread_service_principal.all["key1"] will be updated in-place
  # (imported from "<REDACTED>")
  ~ resource "azuread_service_principal" "all" {
      <REDACTED>
    }

  # azuread_service_principal.all["key2"] will be updated in-place
  # (imported from "<REDACTED>")
  ~ resource "azuread_service_principal" "all" {
      <REDACTED>
    }

  # azurerm_container_registry.this will be updated in-place
  # (imported from "<REDACTED>")
  ~ resource "azurerm_container_registry" "this" {
        <REDACTED>
    }

  # azurerm_role_assignment.acr_pullers["KEY"] must be replaced
  # (imported from "/subscriptions/<REDACTED>/resourceGroups/<REDACTED>/providers/Microsoft.ContainerRegistry/registries/<REDACTED>/providers/Microsoft.Authorization/roleAssignments/<REDACTED>")
  # Warning: this will destroy the imported resource
-/+ resource "azurerm_role_assignment" "acr_pullers" {
      ~ id                               = "/subscriptions/<REDACTED>/resourceGroups/<REDACTED>/providers/Microsoft.ContainerRegistry/registries/<REDACTED>/providers/Microsoft.Authorization/roleAssignments/<REDACTED>" -> (known after apply)
      ~ name                             = "<REDACTED>" -> (known after apply)
      ~ principal_id                     = "<REDACTED>" -> (known after apply)
      ~ principal_type                   = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/<REDACTED>/providers/Microsoft.Authorization/roleDefinitions/<REDACTED>" -> (known after apply)
        role_definition_name             = "AcrPull"
      ~ scope                            = "/subscriptions/<REDACTED>/resourcegroups/<REDACTED>/providers/Microsoft.ContainerRegistry/registries/<REDACTED>" -> "/subscriptions/<REDACTED>/resourceGroups/<REDACTED>/providers/Microsoft.ContainerRegistry/registries/<REDACTED>" # forces replacement
      + skip_service_principal_aad_check = true
    }

Plan: 6 to import, 3 to add, 5 to change, 1 to destroy.

```